#+TITLE: Preliminary Design
#+AUTHOR: Alexander Brown
#+DATE: \today

# =========================================================================================================================
# Babel properties

#+PROPERTY: header-args:octave :session *octave* :results output :exports both

# =========================================================================================================================
# Org LaTeX options

#+OPTIONS: tex:t
#+LATEX_CLASS: article

#+latex_header: \usepackage{amsfonts}                       % Cool math fonts
#+latex_header: \usepackage{amsmath}                        % Maths
#+latex_header: \setlength\parindent{0pt}                   % No indent for paragraphs

#+latex_header: \newcommand{\shall}{\textbf{shall }}

# =========================================================================================================================
# More document configuration

#+begin_export latex
\parskip 3mm                                % Set the vetical space between paragraphs
\let\ref\autoref                            % Redifine `\ref` as `\autoref` because lazy
#+end_export

# =========================================================================================================================
#
#+MACRO: drone-name pigeon

# =========================================================================================================================
#
*** Battery Weight
The {{{drone-name}}} is a battery-driven aircraft. The battery weight is a major contributor to the weight buildup of
the aircraft. \cite{Sadraey2012} shows that for a propeller-driven aircraft, its battery weight ratio can be written as
show in [[eq:battery-weight-ratio]]. $g$ is the gravity constant, $\eta_P$ is the propeller efficiency, $E_D$ energy density
of the battery, $R$ is the desired range, $C_L$ is the cruise lift coefficient, and $C_D$ is the drag due to the
aircraft configuration.

#+name: eq:battery-weight-ratio
#+caption: Estimation of the battery to weight ration
#+begin_export latex
\begin{equation}
\label{eq:battery-weight-ratio}
  W_B = 1.05 \Big( \frac{g}{\eta_P E_D} \frac{R}{C_L / C_D} \Big)
\end{equation}
#+end_export

The propeller efficiency has typical values ranging from 0.6 through 0.8. For the sake of adding safety factors in the
design, the low END of the efficiency shall be used. These values can be seen in [[octave:drag-coefficients]]. The range can
be determined from [[eq:cruise-time]]. $V_C$ denotes the cruising velocity. Preliminary research shows that average starter
RC aircraft velocities rage from 64 to 97 kph. Solving for $R$ is simple, and we have defined the flight time to be
about 10 minutes. The output of [[octave:range]] calculates the estimated range. The propeller efficiency is show in
[[octave:prop-efficiency]] which is taken from \cite{Sadraey2012}. The gravity constant is introduced in [[octave:gravity]].
[[octave:energy-density]] shows the calculation of the battery's estimated energy density. To calculate this value, it is
assumed that the flight time from the design requirement in [[#sec:design-goals]]. Using the ampere-hour rating, dividing it
by the design flight time gives the estimated current from the battery. This current is used to estimate the power
output of the battery so that the energy density can be estimated. The weight of the battery can then be estimated using
the calculation in [[octave:battery-weight]]. The estimate shows that the battery will be about 10% of the aircraft's total
weight.

#+name: octave:drag-coefficients
#+caption: Common drag and lift coefficients used in preliminary design.
#+begin_src octave
  global C_D;
  global C_L;

  C_D = 0.03;                              # Zero-lift drag coefficient: fixed landing gear
  C_L = 1.2;                               # Maximim lift coefficient
#+end_src

#+RESULTS: octave:drag-coefficients


#+name: eq:cruise-time
#+begin_export latex
\begin{equation}
\label{eq:cruise-time}
  t_C = \frac{R}{V_C}
\end{equation}
#+end_export

#+name: octave:range
#+caption: Rane calculation for the {{{drone-name}}}.
#+begin_src octave
  R = (10) * (64 * (1000/60))                      # min * m/min
#+end_src

#+RESULTS: octave:range
: R = 1.0667e+04


#+name: octave:prop-efficiency
#+caption: Propeller efficiency estimate.
#+begin_src octave
  eta_p = 0.6;                                     # Propeller efficiency
#+end_src

#+RESULTS: octave:prop-efficiency


#+name: octave:gravity
#+caption: Gravity constant.
#+begin_src octave
  g = 9.81;                                        # m/s^2
#+end_src

#+RESULTS: octave:gravity


#+name: octave:energy-density
#+caption: Calculation of the estimate for the battery energy density.
#+begin_src octave
  i_b = 4500 / (10) / (1/60) * 0.001;              # A
  P_b = 2.2 * i_b;                                 # v
  m_b = 745 * 0.001;                               # kg
  t_s = 10 / 60;                                   # s
  E_D = P_b*t_s/(m_b)
#+end_src

#+RESULTS: octave:energy-density
:
: octave> octave> octave> E_D = 13.289


#+name: octave:battery-weight
#+caption: Estimate of the battery weight.
#+begin_src octave
  global W_B;
  W_B = 1.05*((g/(eta_p*E_D*3600)) * (R/(C_L/C_D)))
#+end_src

#+RESULTS: octave:battery-weight
:
: W_B = 0.095696

